
markdown语法练习

# markdown语法：

## 1. 标题: #,后面加空格
几级标题几个#  
用“#"表示标题，在行首时起作用，否则就是普通的符号  
#一级标题# //为了让它不起作用，我们在前面加了两个空格，Markdown 处理之后会自动丢弃空格。如果行首用tab 就会使#生效
## 换行：
文本行尾添加两个空格，然后回车。  
## 2. 列表：数字+.+空格
在行首用“-”“”或“*”表示无序列表
在行首用1. 2. 3. 表示是有序列表 
多级在之前加tab
* 列表1
    *
    *
* 列表2
* 列表3  

1. 列表1
    1. 
    2. 
2. 列表2  

## 3. 引用：行首文本之前加 >

> 这是一个引用

## 4. 图片与连接
链接的使用方式是： **[显示内容]（https://note.youdao.com/)**  
图片的使用方式是：**！[显示内容] (地址 "提示语")**  

## 5. 粗体与斜体：* 斜体1/粗体2/斜粗3
用** **来包含需要加粗的文字即可。 粗体 // ** 粗体 ** 为了不让它起作用，我们加了空格
### 1.粗体 **  **
**粗体**
### 2. 斜体 * *
*斜体*  

### 3. 粗斜体  
***斜粗体***  

## 6. 代码框
tab 键缩进之后，的内容会自动作为代码,如果已经缩进过一次之后要添加代码就要用tab 再缩进一级  
或者  
使用 `````` 英文状态的三个左上角波浪线包裹

     int main()
     {
      printf("hello");
    }
  
  
## 7. 分割线：三个-或三个*
 ---
 ***
分割线

## 8. 高亮：== ==
==高亮显示==

## 9.删除线：~~~~中文状态波浪线
~~删除线~~

## 10. 选择框： - [ ] 顶头每个字符加空格

- [ ] 未选
- [x] 已选

## 11.插入html： < html>< /html>

<html>
<div>html内容</div>
</html>

## 12. 表格：header、 row、 col

header 1 | header 2
---|---
row 1 col 1 | row 1 col 2
row 2 col 1 | row 2 col 2

## 13.方程式： `` `math +```

```math
E = mc^2
```
## 14.关系指向： 
```
graph LR
A-->B
```

```
sequenceDiagram
A->>B: How are you?
B->>A: Great!
```

```
gantt
dateFormat YYYY-MM-DD
section S1
T1: 2014-01-01, 9d
section S2
T2: 2014-01-11, 9d
section S3
T3: 2014-01-02, 9d
```

